# 8. Написати функцію, яка буде реалізувати логіку циклічного зсуву елементів в списку. Тобто, функція приймає два аргументи: список і величину зсуву (якщо ця величина додатня - пересуваємо з кінця на початок, якщо від'ємна - навпаки - пересуваємо елементи з початку списку в його кінець).
# Наприклад:
#       fnc([1, 2, 3, 4, 5], shift=1) --> [5, 1, 2, 3, 4]
#       fnc([1, 2, 3, 4, 5], shift=-2) --> [3, 4, 5, 1, 2]

# Моя відповідь: 

def fun1(i, shift):
	

	if shift < 0:
		i = i[shift:] + i[:shift]
		print(i)

	else:
		i = i[-shift:] + i[:-shift]
		print(i)

	return 

fun1([1, 2, 3, 4, 5], 1)