#5. Користувач вводить змiннi "x" та "y" з довiльними цифровими значеннями;
#-  Створiть просту умовну конструкцiю(звiсно вона повинна бути в тiлi ф-цiї), пiд час виконання якої буде перевiрятися рiвнiсть змiнних "x" та "y" і при нерiвностi змiнних "х" та "у" вiдповiдь повертали рiзницю чисел.
#-  Повиннi опрацювати такi умови:
#-  x > y;       вiдповiдь - х бiльше нiж у на z
#-  x < y;       вiдповiдь - у бiльше нiж х на z
#-  x == y.      вiдповiдь - х дорiвнює z

# Моя відповідь:

x = int(input())
y = int(input())


def totozhnist(x, y):
	z = abs(x - y)

	if x > y:
		print('х бiльше нiж у на', z)
	elif x < y:
		print('у бiльше нiж х на', z)
	else:
		print('х дорiвнює y')
	return


totozhnist(x, y)