# 7. Ну і традиційно -> калькулятор :) повинна бути 1 ф-цiя яка б приймала 3 аргументи - один з яких операцiя, яку зробити!

# Моя відповідь:

def my_calculate(a, b, c):
	
	if c == '*':
		print(a * b)  # множення
	elif c == '/':
		print(a / b)  # ділення
	elif c == '+':
		print(a + b)  # додавання
	elif c == '-':
		print(a - b)  # віднімання
	elif c == '**':
		print(a ** b)  # піднесення до степеня
	elif c == '//':
		print(a // b)  # цілочисельний результат ділення
	return


my_calculate(5, 2 , '//')