#3. Написати функцію, яка приймає два параметри: ім'я файлу та кількість символів.
#   На екран повинен вивестись список із трьома блоками - символи з початку, із середини та з кінця файлу.
#   Кількість символів в блоках - та, яка введена в другому параметрі.
#   Придумайте самі, як обробляти помилку, наприклад, коли кількість символів більша, ніж є в файлі (наприклад, файл із двох символів і треба вивести по одному символу, то що виводити на місці середнього блоку символів?)

# Моя відповідь: 

def check_file(file_name, n):
	f = open(file_name, 'r')
	m = len(f.read())
	#print(m)
	
	if m < n:
		f.seek(0)
		print('Список символів з початку файлу:' + f.read(n))
		print(f'Список символів із середини файлу неможливий, адже в файлі лише {m} символів')
		f.seek(0)
		print('Список символів з кінця файлу:' + str(f.read(n)[::-1]))

		
		
	elif m > n:
		f.seek(0)
		print('Список символів з початку файлу:' + f.read(n))
		
		b = m//2 - n//2
		f.seek(b)
		print('Список символів із середини файлу:' + f.read(n))
		
		c = m-n
		f.seek(c+1)
		print('Список символів з кінця файлу:' + str(f.read(n)[::-1]))

	elif m == n:
		f.seek(0)
		print('Список символів з початку файлу:' + f.read(n))
		
		b = m//2
		f.seek(b)
		print('Список символів із середини файлу:' + f.read(n))
		
		c = m-n
		f.seek(c+1)
		print('Список символів з кінця файлу:' + str(f.read(n)[::-1]))


	f.close()
	#print(f.closed)
	return



check_file('Test_for_HW3.txt', 3)
