# 7. Реалізуйте генератор, який приймає на вхід будь-яку ітерабельну послідовність (рядок, список, кортеж) і повертає генератор, який буде вертати значення з цієї послідовності, при цьому, якщо було повернено останній елемент із послідовності - ітерація починається знову.
#   Приклад (якщо запустили його у себе - натисніть Ctrl+C ;) ):
#   >>>for elem in generator([1, 2, 3]):
#   ...    print(elem)
#   ...
#   1
#   2
#   3
#   1
#   2
#   3
#   1
#   .......

# Моя відповідь:


def iter_test(n):
	
	a = n.__iter__()
	
	while True:
		try:
			yield next(a)
							
		except StopIteration:
			a = n.__iter__()


for elem in iter_test([1, 2, 3]):
	print(elem)

